# 4.Реализуйте алгоритм перемешивания списка, без использования встроеных методов (особенно SHUFFLE,
# без него) можно (нужно) использовать библиотеку Random

professions = ['Journalist', 'Economist', 'IT specialist']
print(f'Введены мои профессии: {professions}')
professions.reverse()
print(f'Перетряхнув список в обратном порядке, получилось: {professions}')

